{
  "id": "E2025009",
  "projectId": ["P2025008", "P2025009"],
  "prefix": "The Double Return",
  "names": ["Carne Asada", "Tripel Hop"],
  "startDate": "4th of April",
  "endDate": "6th of April",
  "features": {
    "accommodation": ["Inverness Youth Hostel"]
  },
  "description": "This weekend was a perfect example of what makes the previous one so damn worth it. Another standard procedure at 5:01 on Friday of getting goddamn up north for a double proj. This time, in quite the opposing weather conditions to the previous weekend. We were a full week into the 24/7 bluebird days and thankfully ran no risk of getting thunderbombed by a blasting by a change in the weather. In fact, it's forecast to continue for another week drr drr. I could get used to this. Anyway, adding to the delight, the Inverness hostel was a surprising delight this weekend, filled with old-timer sea kayakers. All I will say is, for once the hostel was clean and scentless. Make of that what you will. We had a very successful Friday night of teas, and booking the next few weeks of hostels and Scandinavian holidays. A bright and early start on Saturday took us to the first return project of the weekend, which was Càrn Eige; the three Munros we had to bail on when we attempted the Affric six last year due to the neck-deep snow. What a delightful return. But of course, the biggest delight came in the evening; the CHOUFFEs and Duvels. We had the whole TV room to ourselves, and put on a huge spread of venison, beer, YouTube, and Maccies. The desk-TV hybrid, if you will. It was a tough 7am rise on Sunday after the night of 9%'ers, but we got it done. In fact, in almost a KOM-like fashion. Although we ended up missing the Corbett on the Sunday route, we got the second return in of the weekend successfully. Even if I don't remember the walk-in terribly clearly. The only downer of the weekend was the queue for Bruar ice cream preventing us from getting a hit. I call that a large success. Every goddamn weekend, we double-proj.",
  "images": [
    {
      "url": "https://lewisbritton.com/images/blog/instant-gram/2025/the-double-return/1.jpg",
      "alt": "the-double-return-1"
    }
  ]
}
